app/views/favorites/_like.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
    <%= link_to book_favorites_path(book), method: :delete, remote: true, class: "fas fa-heart heart_red" do %>
    <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
    <%= link_to book_favorites_path(book), method: :post, remote: true, class: "fas fa-heart heart_blue" do %>
    <%= book.favorites.count %>