app/controllers/books_controller.rb

  def index
    @books = Book.all.order(params[:sort])
---
SELECT "books".* FROM "books" ORDER BY created_at: DESC

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "rate", "category") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "a"], ["body", "aa"], ["user_id", 1], ["created_at", "2021-11-09 02:49:16.603148"], ["updated_at", "2021-11-09 02:49:16.603148"], ["rate", 3.0], ["category", "1"]]