app/models/user.rb

SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follower_id" WHERE "relationships"."following_id" = ? AND "users"."id" = ? LIMIT ?  [["following_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def following?(user)
    followings.include?(user)